[
  {
    "company": "The Luupe",
    "start": "2022-04-10T12:00:00.000Z",
    "end": null,
    "title": "Senior Software Developer",
    "description": [
      "In my role at a dynamic startup company, I served as a software developer with a core focus on maintaining and advancing an innovative application designed to connect women and non-binary photographers with companies seeking specific photography services.",
      "I was deeply integrated with the product team, operating with a high degree of autonomy and shouldering significant responsibility for technology decision-making to align with both business and client requirements.",
      "The application was crafted using modern technology, built on Next.js with TypeScript and GraphQL. This allowed us to deliver a responsive, efficient and low-cost platform.",
      "Additionally, the application's infrastructure was designed and implemented using Google Cloud Platform (GCP), contributing to a scalable solution that met the needs of both our users and clients."
    ],
    "keywords": ["Javascript", "Typescript", "Next.JS", "GCP", "GraphQL"]
  },
  {
    "company": "Thoughtworks",
    "start": "2019-02-10T12:00:00.000Z",
    "end": "2022-04-10T12:00:00.000Z",
    "title": "Lead Consultant Developer",
    "description": [
      "Worked as a consultant on projects for a digital bank, focusing on credit card solutions.",
      "Collaborated with clients to develop new features, improving the customer experience.",
      "Advocated for development and agile best practices.",
      "Planned and architected frontend applications using microfrontend approaches with Single SPA and React.",
      "Mentored and led other developers, facilitating knowledge sharing and problem-solving."
    ],
    "keywords": ["Kotlin", "React", "AWS", "Microservices", "Microfrontends", "GraphQL"]
  },
  {
    "company": "Itaú Unibanco",
    "start": "2018-11-10T12:00:00.000Z",
    "end": "2019-02-10T12:00:00.000Z",
    "title": "Solutions Architect",
    "description": [
      "Contributed to the Solutions Architecture team at Brazil's largest bank.",
      "Authored development guidelines and customized in-development software for client-specific hardware environments.",
      "Worked closely with developers and engineers to implement technological solutions.",
      "Designed migration strategies to bridge gaps between existing software architecture and future updates."
    ],
    "keywords": ["Java", "Spring", "Apache Camel", "Springboot", ".Net Framework"]
  },
  {
    "company": "Netbiis Software",
    "start": "2017-06-10T12:00:00.000Z",
    "end": "2018-11-10T12:00:00.000Z",
    "title": "Senior Fullstack Developer",
    "description": [
      "Worked at a small Brazilian software company that provided global solutions, progressing from a full-stack developer to a software architect and lead developer. Initially, I independently developed all application solutions for a California-based startup, actively participating in all development phases, from conception to delivery. For this client, I created backend services utilizing REST APIs, integrating with timesheet software such as Homebase and ADB.",
      "Frontend development involved Angular for web applications and both Ionic and Android Native for mobile development. In my role as a software architect, I played a pivotal part in defining architectural patterns and principles for restructuring the core application of the company's main client.",
      "This particular software served as a B2B solution for travel companies, facilitating hotel availability, car rentals, ticketing, and transfers. The backend was developed using .NET Core, employing a Domain-Driven Design (DDD) approach to construct separate microservices catering to distinct business domains. All frontend development leveraged Angular 5+.",
      "Beyond coding, I engaged in code reviews to ensure adherence to established patterns and actively assisted other developers through pair programming."
    ],
    "keywords": [".NET Core", "Nodejs", "Angular", "Ionic", "Android"]
  },
  {
    "company": "Aurea Software",
    "start": "2016-06-10T12:00:00.000Z",
    "end": "2017-06-10T12:00:00.000Z",
    "title": "Software Engineer",
    "description": [
      "Employed at one of the world's largest software companies, I was part of a dedicated team with a primary focus on unit testing and enhancing code quality across numerous projects developed in C# and Java.",
      "In this role, my responsibilities encompassed code refactoring, the creation of both unit and integration tests, and the development of scripts for automating unit test execution within CI/CD pipelines.",
      "I also played a key role in defining patterns and strategies to effectively implement unit tests in existing applications, ensuring comprehensive code coverage and quality improvement."
    ],
    "keywords": ["TDD", "Unit Tests", "CI/CD", "Test Automatization", "Java", ".Net Framework"]
  },
  {
    "company": "Digitalmed Technology",
    "start": "2012-09-10T12:00:00.000Z",
    "end": "2016-06-10T12:00:00.000Z",
    "title": "Senior Software Developer",
    "description": [
      "As a member of the development team for a substantial Laboratory Information Management System (LIS), I assumed a pivotal role in various capacities:",
      "I gained valuable experience in technical leadership, taking the lead in code reviewing and contributing to the definition of architectural strategies.",
      "My primary responsibility revolved around enhancing performance and offering technical guidance to new team members, thus contributing to the system's efficiency.",
      "I played a crucial role in transitioning a complex monolithic application to a microservices architecture, which significantly improved scalability and availability.",
      "The project involved working on an extensive and intricate application, comprising numerous modules and environments.",
      "Technologies used included C#, ASP.Net (WebForms, MVC, and Web.API), NHibernate, WCF, Windows Forms, Silverlight, Windows Services, and extensive use of JavaScript, jQuery, and Angular JS, among other technologies."
    ],
    "keywords": [
      ".NET Framework",
      "Vanilla JS",
      "AWS",
      "AngularJS",
      "ASP.NET Web API",
      "Tech Leading",
      "Windows Services",
      "Windows Forms",
      "WCF",
      "Silverlight"
    ]
  },
  {
    "company": "Adapt Solutions",
    "start": "2011-01-10T12:00:00.000Z",
    "end": "2012-09-10T12:00:00.000Z",
    "title": "Software Developer",
    "description": [
      "I was engaged as a developer tasked with enhancing and introducing new features to a public school management application.",
      "My primary responsibility entailed creating a dynamic reporting system designed to serve teachers and administrators in collecting student data, generating comprehensive statistics, and producing informative charts.",
      "This web application was developed using ASP.Net WebForms, SQL Server, and incorporated jQuery and Ajax to enhance interactivity and responsiveness, ensuring an effective and user-friendly solution for educators and school administrators."
    ],
    "keywords": [".NET Framework", "ASP.NET Webforms", "JQuery", "ASP.NET MVC", "SQL Server"]
  },
  {
    "company": "CWI Software",
    "start": "2010-06-10T12:00:00.000Z",
    "end": "2011-01-10T12:00:00.000Z",
    "title": "Software Developer",
    "description": [
      "Outsourced developer working for a banking company, developing integrations between legacy systems and new applications being developed Participation developing an application using SOA architecture with WCF and WPF front ends."
    ],
    "keywords": ["WPF", "WCF", "System Integrations", "SOA", "SQL Server"]
  },
  {
    "company": "Seeker Technology",
    "start": "2008-09-10T12:00:00.000Z",
    "end": "2010-06-10T12:00:00.000Z",
    "title": "Junior Software Developer",
    "description": [
      "Hired as developer to work in a human resource application used to control recruitment processes. Recruiters could search with complex filters for specific candidate profiles and manage all communication between recruiters and candidates. Candidates could create, import and maintain their resumes within the platform and even import information from Linkedin. Responsible for adding a new feature that allowed recruiters search text inside PDF and Word Documents saved on the database using full text search."
    ],
    "keywords": ["ASP.NET Webforms", "JQuery", "SQL Server", "VB.NET", "IIS", "WCF"]
  }
]
