[
  {
    "company": "The Luupe",
    "start": "2022-04-10T12:00:00.000Z",
    "end": null,
    "title": "Desenvolvedor de Software Sênior",
    "description": [
      "No meu papel em uma startup dinâmica, atuei como desenvolvedor de software com foco principal na manutenção e avanço de uma aplicação inovadora projetada para conectar mulheres e fotógrafos não binários a empresas que buscam serviços específicos de fotografia.",
      "Estive profundamente integrado à equipe de produtos, operando com alto grau de autonomia e assumindo significativa responsabilidade na tomada de decisões tecnológicas para atender aos requisitos de negócios e dos clientes.",
      "A aplicação foi desenvolvida com tecnologia moderna, construída com Next.js, TypeScript e GraphQL. Isso nos permitiu oferecer uma plataforma responsiva, eficiente e de baixo custo.",
      "Além disso, a infraestrutura da aplicação foi projetada e implementada usando o Google Cloud Platform (GCP), contribuindo para uma solução escalável que atendia às necessidades de nossos usuários e clientes."
    ],
    "keywords": ["Javascript", "Typescript", "Next.JS", "GCP", "GraphQL"]
  },
  {
    "company": "Thoughtworks",
    "start": "2019-02-10T12:00:00.000Z",
    "end": "2022-04-10T12:00:00.000Z",
    "title": "Consultor Líder de Desenvolvimento",
    "description": [
      "Trabalhei como consultor em projetos para um banco digital, com foco em soluções de cartão de crédito.",
      "Colaborei com os clientes para desenvolver novos recursos, melhorando a experiência do cliente.",
      "Defendi as melhores práticas de desenvolvimento e ágeis.",
      "Planejei e arquitetei aplicações frontend usando abordagens de microfrontend com Single SPA e React.",
      "Orientei e liderei outros desenvolvedores, facilitando o compartilhamento de conhecimento e resolução de problemas."
    ],
    "keywords": ["Kotlin", "React", "AWS", "Microservices", "Microfrontends", "GraphQL"]
  },
  {
    "company": "Itaú Unibanco",
    "start": "2018-11-10T12:00:00.000Z",
    "end": "2019-02-10T12:00:00.000Z",
    "title": "Arquiteto de Soluções",
    "description": [
      "Contribuí para a equipe de Arquitetura de Soluções no maior banco do Brasil.",
      "Elaborei diretrizes de desenvolvimento e personalizei software em desenvolvimento para ambientes de hardware específicos do cliente.",
      "Trabalhei em estreita colaboração com desenvolvedores e engenheiros para implementar soluções tecnológicas.",
      "Projetei estratégias de migração para preencher lacunas entre a arquitetura de software existente e atualizações futuras."
    ],
    "keywords": ["Java", "Spring", "Apache Camel", "Springboot", ".Net Framework"]
  },
  {
    "company": "Netbiis Software",
    "start": "2017-06-10T12:00:00.000Z",
    "end": "2018-11-10T12:00:00.000Z",
    "title": "Desenvolvedor Fullstack Sênior",
    "description": [
      "Trabalhei em uma pequena empresa de software brasileira que fornecia soluções globais, progredindo de desenvolvedor full-stack a arquiteto de software e líder de desenvolvimento. Inicialmente, desenvolvi independentemente todas as soluções de aplicativos para uma startup da Califórnia, participando ativamente de todas as fases de desenvolvimento, desde a concepção até a entrega. Para esse cliente, criei serviços de backend utilizando APIs REST, integrando-se a software de controle de horas, como Homebase e ADB.",
      "O desenvolvimento frontend envolveu o uso de Angular para aplicações web e tanto Ionic quanto Android Nativo para desenvolvimento móvel. Como arquiteto de software, desempenhei um papel fundamental na definição de padrões arquitetônicos e princípios para reestruturar a aplicação principal da empresa.",
      "Esse software específico serviu como uma solução B2B para empresas de viagens, facilitando a disponibilidade de hotéis, aluguel de carros, emissão de ingressos e transferências. O backend foi desenvolvido com .NET Core, empregando uma abordagem de Design Orientado ao Domínio (DDD) para construir microserviços separados que atendem a domínios de negócios distintos. Todo o desenvolvimento frontend foi alavancado pelo Angular 5+.",
      "Além da codificação, participei de revisões de código para garantir a adesão a padrões estabelecidos e auxiliei ativamente outros desenvolvedores por meio de programação em pares."
    ],
    "keywords": [".NET Core", "Nodejs", "Angular", "Ionic", "Android"]
  },
  {
    "company": "Aurea Software",
    "start": "2016-06-10T12:00:00.000Z",
    "end": "2017-06-10T12:00:00.000Z",
    "title": "Engenheiro de Software",
    "description": [
      "Empregado em uma das maiores empresas de software do mundo, fiz parte de uma equipe dedicada com foco principal em testes unitários e melhoria da qualidade do código em diversos projetos desenvolvidos em C# e Java.",
      "Nesse papel, minhas responsabilidades incluíram refatoração de código, criação de testes unitários e de integração, e desenvolvimento de scripts para automação de testes unitários em pipelines de CI/CD.",
      "Também desempenhei um papel fundamental na definição de padrões e estratégias para implementar efetivamente testes unitários em aplicações existentes, garantindo uma cobertura abrangente de código e melhoria da qualidade."
    ],
    "keywords": [
      "TDD",
      "Testes Unitários",
      "CI/CD",
      "Automatização de Testes",
      "Java",
      ".Net Framework"
    ]
  },
  {
    "company": "Digitalmed Technology",
    "start": "2012-12-10T12:00:00.000Z",
    "end": "2016-06-10T12:00:00.000Z",
    "title": "Desenvolvedor de Software Sênior",
    "description": [
      "Como membro da equipe de desenvolvimento de um substancial Sistema de Gerenciamento de Informações de Laboratório (LIS), assumi um papel fundamental em diversas capacidades:",
      "Adquiri valiosa experiência em liderança técnica, assumindo a liderança na revisão de código e contribuindo para a definição de estratégias arquiteturais.",
      "Minha principal responsabilidade envolvia a melhoria de desempenho e a orientação técnica de novos membros da equipe, contribuindo assim para a eficiência do sistema.",
      "Desempenhei um papel crucial na transição de uma aplicação monolítica complexa para uma arquitetura de microserviços, o que melhorou significativamente a escalabilidade e disponibilidade.",
      "O projeto envolveu trabalhar em uma aplicação extensa e intricada, composta por numerosos módulos e ambientes.",
      "As tecnologias utilizadas incluíram C#, ASP.Net (WebForms, MVC e Web.API), NHibernate, WCF, Windows Forms, Silverlight, Windows Services e extenso uso de JavaScript, jQuery e Angular JS, entre outras tecnologias."
    ],
    "keywords": [
      ".NET Framework",
      "Vanilla JS",
      "AWS",
      "AngularJS",
      "ASP.NET Web API",
      "Liderança Técnica",
      "Windows Services",
      "Windows Forms",
      "WCF",
      "Silverlight"
    ]
  },
  {
    "company": "Adapt Solutions",
    "start": "2011-01-10T12:00:00.000Z",
    "end": "2012-09-10T12:00:00.000Z",
    "title": "Desenvolvedor de Software",
    "description": [
      "Fui contratado como desenvolvedor com a tarefa de aprimorar e introduzir novos recursos em um aplicativo de gerenciamento de escolas públicas.",
      "Minha principal responsabilidade envolveu a criação de um sistema dinâmico de relatórios projetado para atender a professores e administradores na coleta de dados de alunos, geração de estatísticas abrangentes e produção de gráficos informativos.",
      "Esta aplicação web foi desenvolvida usando ASP.Net WebForms, SQL Server e incorporou jQuery e Ajax para aprimorar a interatividade e responsividade, garantindo uma solução eficaz e amigável para educadores e administradores escolares."
    ],
    "keywords": [".NET Framework", "ASP.NET Webforms", "JQuery", "ASP.NET MVC", "SQL Server"]
  },
  {
    "company": "CWI Software",
    "start": "2010-06-10T12:00:00.000Z",
    "end": "2011-01-10T12:00:00.000Z",
    "title": "Desenvolvedor de Software",
    "description": [
      "Desenvolvedor terceirizado trabalhando para uma empresa bancária, desenvolvendo integrações entre sistemas legados e novas aplicações em desenvolvimento. Participação no desenvolvimento de uma aplicação usando arquitetura SOA com front-ends WCF e WPF."
    ],
    "keywords": ["WPF", "WCF", "Integração de Sistemas", "SOA", "SQL Server"]
  },
  {
    "company": "Seeker Technology",
    "start": "2008-09-10T12:00:00.000Z",
    "end": "2010-06-10T12:00:00.000Z",
    "title": "Desenvolvedor de Software Júnior",
    "description": [
      "Contratado como desenvolvedor para trabalhar em um aplicativo de recursos humanos usado para controlar processos de recrutamento. Os recrutadores podiam pesquisar com filtros complexos perfis específicos de candidatos e gerenciar toda a comunicação entre recrutadores e candidatos. Os candidatos podiam criar, importar e manter seus currículos na plataforma e até importar informações do LinkedIn. Responsável por adicionar um novo recurso que permitia aos recrutadores buscar texto em documentos PDF e Word salvos no banco de dados usando busca em texto completo."
    ],
    "keywords": ["ASP.NET Webforms", "JQuery", "SQL Server", "VB.NET", "IIS", "WCF"]
  }
]
